Revit 2026 API

# FamilyItemFactoryNewDiameterDimension Method

---

Creates a new diameter dimension object using the default dimension type.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Dimension NewDiameterDimension(
	View view,
	Reference arcRef,
	XYZ origin
)
```
```vb
Public Function NewDiameterDimension (
	view As View,
	arcRef As Reference,
	origin As XYZ
) As Dimension
```
```cpp
public:
Dimension^ NewDiameterDimension(
	View^ view,
	Reference^ arcRef,
	XYZ^ origin
)
```
```fsharp
member NewDiameterDimension :
        view : View *
        arcRef : Reference *
        origin : XYZ -> Dimension
```

#### Parameters

view View
     The view in which the dimension is to be visible.
arcRef Reference
     Geometric reference of the arc to which the dimension is to be bound.
origin XYZ
     The point where the witness line of the diameter dimension will lie.

#### Return Value

DimensionIf creation was successful the new diameter dimension is returned, otherwise an exception with failure information will be thrown.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when any input argument is . |
| ArgumentException | Thrown when the argument arcRef is invalid. |
| InvalidOperationException | Thrown when the creation failed. |

The currently user set default style is used for the created dimension.

#### Reference

FamilyItemFactory Class

Autodesk.Revit.Creation Namespace